In [1]:
import pandas as pd

In [2]:
dt = pd.read_csv('data.csv')
dt

        km  price
0   240000   3650
1   139800   3800
2   150500   4400
3   185530   4450
4   176000   5250
5   114800   5350
6   166800   5800
7    89000   5990
8   144500   5999
9    84000   6200
10   82029   6390
11   63060   6390
12   74000   6600
13   97500   6800
14   67000   6800
15   76025   6900
16   48235   6900
17   93000   6990
18   60949   7490
19   65674   7555
20   54000   7990
21   68500   7990
22   22899   7990
23   61789   8290

In [4]:
dt.describe()

                  km        price
count      24.000000    24.000000
mean   101066.250000  6331.833333
std     52674.245606  1319.654193
min     22899.000000  3650.000000
25%     65020.500000  5687.500000
50%     83014.500000  6495.000000
75%    140975.000000  7115.000000
max    240000.000000  8290.000000

In [5]:
print(dt)

        km  price
0   240000   3650
1   139800   3800
2   150500   4400
3   185530   4450
4   176000   5250
5   114800   5350
6   166800   5800
7    89000   5990
8   144500   5999
9    84000   6200
10   82029   6390
11   63060   6390
12   74000   6600
13   97500   6800
14   67000   6800
15   76025   6900
16   48235   6900
17   93000   6990
18   60949   7490
19   65674   7555
20   54000   7990
21   68500   7990
22   22899   7990
23   61789   8290

In [9]:
print(dt['km'][1])

139800